# --- ARCHINSTALL HYPRLAND PROFILE ---
hyprland
hyprpaper
hyprlock
hypridle
xdg-desktop-portal-hyprland
polkit-kde-agent
qt5-wayland
qt6-wayland
kitty
rofi-wayland
waybar
grim
slurp
wl-clipboard

# --- SISTEMA BASE Y BOOT ---
linux
linux-headers
linux-firmware
amd-ucode
base
base-devel
grub
efibootmgr
os-prober
sudo
zram-generator

# --- DISPLAY MANAGER Y COMPLEMENTOS XDG ---
sddm
xdg-desktop-portal-gtk
qt5-graphicaleffects
qt5-quickcontrols
qt5-quickcontrols2
qt5-svg

# --- HERRAMIENTAS DE ESCRITORIO ---
swaync
swappy
nwg-look
libnotify
gnome-keyring
seahorse
python-pywal

# --- AUDIO, VIDEO Y MULTIMEDIA ---
pipewire
pipewire-pulse
pipewire-alsa
pipewire-jack
wireplumber
gst-plugin-pipewire
pavucontrol
imv
mpv
mpv-mpris

# --- REDES Y COMUNICACIONES ---
networkmanager
network-manager-applet
iwd
wpa_supplicant
wireless_tools

# --- DRIVERS Y HARDWARE ---
bluez
bluez-utils
vulkan-intel
vulkan-radeon
intel-media-driver
libva-intel-driver
xf86-video-amdgpu
sof-firmware
smartmontools
power-profiles-daemon
brightnessctl
socat
jq

# --- EDITORES Y DESARROLLO ---
neovim
code
zed
godot

# --- APLICACIONES DE USUARIO ---
obsidian
steam
zathura
zathura-pdf-mupdf
foliate
nemo

# --- UTILIDADES DE SISTEMA ---
git
github-cli
wget
ncdu
htop
unzip
ntfs-3g
xdg-utils
expac

# --- FUENTES Y TEMAS ---
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols-common
otf-font-awesome
woff2-font-awesome
materia-gtk-theme
papirus-icon-theme
gnome-themes-extra
icon-library
grub-theme-vimix

# --- DEPENDENCIAS ADICIONALES / LIBRERÍAS ---
python-pip
python-pillow
python-evdev
imagemagick
